using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using DIALOGUE;

namespace TESTING
{
    public class TestingArchitect : MonoBehaviour
    {
        DialogueSystem ds;
        TextArchitect architect;
        string[] Lines = new string[6]{
            "เฮ้อ... เดี๋ยวนี้อะไรๆ ก็เปลี่ยนไปหมด สมัยก่อนนะ เงินแค่นี้ซื้อข้าวได้เป็นกิโล เดี๋ยวนี้ได้แค่ห่อเดียว!",
            "เด็กสมัยนี้เอาแต่ก้มหน้าเล่นโทรศัพท์ ไม่เห็นมีใครยกมือไหว้คนแก่เหมือนเมื่อก่อนเลย!",
            "เมื่อวานเดินไปตลาด ยังไม่ทันต่อราคา แม่ค้าก็ทำหน้าเบื่อโลกใส่ แบบนี้มันจะค้าขายกันได้ยังไง!",
            "เปิดทีวีมาก็มีแต่ข่าวฆ่ากัน ปล้นกัน เมื่อก่อนบ้านช่องไม่ต้องล็อกประตูกันขนาดนี้ก็ยังอยู่กันได้!",
            "พูดไปก็ไม่มีใครฟัง คนแก่พูดอะไรก็หาว่าบ่น เออ! แล้วจะให้ทำยังไงล่ะ ถ้าไม่บ่นก็อกแตกตายกันพอดี!",
            "เฮ้อ… เดี๋ยวนี้อะไรๆ ก็เปลี่ยนไปหมด ไม่เหมือนสมัยก่อนที่คนเขายังรู้จักมารยาท มีสัมมาคารวะ เด็กเดินผ่านผู้ใหญ่ก็ต้องยกมือไหว้ ไม่ใช่เอาแต่ก้มหน้าก้มตากดโทรศัพท์ เดินชนคนอื่นยังไม่ขอโทษเลยด้วยซ้ำ แล้วดูค่าครองชีพสิ เมื่อก่อนเงินสิบบาทซื้อข้าวได้เป็นกิโล เดี๋ยวนี้ได้แค่ห่อเดียว แถมยังไม่อิ่มอีกต่างหาก จะกินอะไรก็แพงไปหมด ค่าไฟค่าน้ำขึ้นเอาขึ้นเอา แต่เงินเดือนคนทำงานก็ยังเท่าเดิม แล้วไม่ต้องพูดถึงพวกคนแก่ที่เกษียณแล้วเถอะ ได้เงินบำนาญมาก็แทบไม่พอใช้ ต้องมานั่งอดออมจนลำบาก พอเปิดทีวีมาก็มีแต่ข่าวฆ่ากัน ปล้นกัน สมัยก่อนบ้านช่องไม่ต้องล็อกขนาดนี้ก็ยังอยู่กันได้ เดี๋ยวนี้ประตูติดกล้องวงจรปิด มีรั้วไฟฟ้า ก็ยังโดนขโมยขึ้นบ้านอยู่ดี แล้วไหนจะเรื่องคนขับรถบนถนนอีก ขับกันเหมือนไม่มีพ่อแม่สอน จะเปลี่ยนเลนก็ไม่เปิดไฟเลี้ยว จะแซงก็แซงแบบไม่ดูหัวดูท้าย คิดแล้วก็เหนื่อยใจ สมัยก่อนขนาดถนนมีไม่กี่สาย รถก็น้อยกว่านี้ ยังขับกันเป็นระเบียบมากกว่าเดี๋ยวนี้เยอะ อะไรๆ มันก็ไม่เหมือนเดิมแล้วจริงๆ พูดไปก็ไม่มีใครฟัง คนแก่พูดอะไรก็หาว่าบ่น เออ! แล้วจะให้ทำยังไงล่ะ ถ้าไม่บ่นก็อกแตกตายกันพอดี!"
        };
        // Start is called before the first frame update
        void Start()
        {
            ds = DialogueSystem.instance;
            architect = new TextArchitect(ds.dialogueContainer.dialogueText);
            architect.buildMethod = TextArchitect.BuildMethod.typewriter;
        }

        // Update is called once per frame
        void Update()
        {
            if (Input.GetKeyDown(KeyCode.Z))
            {
                if (architect.isBuilding)
                {
                    if(!architect.speedUp)
                        architect.speedUp = true;
                    else
                        architect.ForceComplete();
                }
                else
                {
                    architect.Build(Lines[5]);
                }
                architect.Build(Lines[5]);
            }
            else if (Input.GetKeyDown(KeyCode.A))
            {
                architect.Append(Lines[5]);
            }
        }
    }
}
